@php
    $aboutItems = [
        [
            "text" => "Ми – волонтерська ініціатива Tako,",
            "span" => " яка займається виробництвом комплектуючих для дронів, зброї та інших важливих рішень для фронту. Використовуючи 3D-друк, ми можемо швидко, точно та дешево виготовляти те, чого бракує нашим захисникам."
        ],
        [
            "text" => "Наша місія – максимальна ефективність кожної гривні допомоги.",
            "span" => "Ми націлені не на прибуток, а на результат – безперебійну підтримку підрозділів, які боронять Україну."
        ],
        [
            "text" => "",
            "span" => "Усе, що ми робимо, – це результат об’єднання знань, рук та сердець людей, які не можуть стояти осторонь."
        ]
    ]

@endphp


<div class="aboutContainer">
    <h1>Про нас</h1>
    <hr />
    <ul>
        @foreach ($aboutItems as $item)
            <li>
                {{ $item['text'] }}<span>{{ $item['span'] }}</span>
            </li>
        @endforeach
    </ul>
</div>