@php
    $products = [
        [
            "img" => [""],
            "title" => "Пристрій швидкого спорядження набоїв",
            "characteristics" => ["AK", "Калібр — 5,45", "Калібр — 7,62", "Вага — 56 гр"],
            "subtitle" => "Портативний та легкий пристрій. Може використовуватись за несприятливих погодних умов (в дощ/сніг, при низькій/високій температурі) ",
            "details" => ['Всі металеві компоненти – з нержавіючої сталі', 'Механізм кріплення повністю співпадає з оригінальним на зброї ', 'Є можливість кріплення до спорядження ', 'Повністю сумісний як з армійськими так і з цивільними магазинами різних виробників'],
            "benefits" => ["Зручніше в темряві", "Зручніше на морозі", "Швидше споряджання", "Менше зусиль при заряджанні"],
            "cost" => 10,
            "count" => 1345
        ],
        [
            "img" => [""],
            "title" => "Пристрій швидкого спорядження набоїв",
            "characteristics" => ["AK", "Калібр — 5,45", "Калібр — 7,62", "Вага — 56 гр"],
            "subtitle" => "Портативний та легкий пристрій. Може використовуватись за несприятливих погодних умов (в дощ/сніг, при низькій/високій температурі) ",
            "details" => ['Всі металеві компоненти – з нержавіючої сталі', 'Механізм кріплення повністю співпадає з оригінальним на зброї ', 'Є можливість кріплення до спорядження ', 'Повністю сумісний як з армійськими так і з цивільними магазинами різних виробників'],
            "benefits" => ["Зручніше в темряві", "Зручніше на морозі", "Швидше споряджання", "Менше зусиль при заряджанні"],
            "cost" => 10,
            "count" => 1345
        ],

        [
            "img" => [""],
            "title" => "Пристрій швидкого спорядження набоїв",
            "characteristics" => ["AK", "Калібр — 5,45", "Калібр — 7,62", "Вага — 56 гр"],
            "subtitle" => "Портативний та легкий пристрій. Може використовуватись за несприятливих погодних умов (в дощ/сніг, при низькій/високій температурі) ",
            "details" => ['Всі металеві компоненти – з нержавіючої сталі', 'Механізм кріплення повністю співпадає з оригінальним на зброї ', 'Є можливість кріплення до спорядження ', 'Повністю сумісний як з армійськими так і з цивільними магазинами різних виробників'],
            "benefits" => ["Зручніше в темряві", "Зручніше на морозі", "Швидше споряджання", "Менше зусиль при заряджанні"],
            "cost" => 10,
            "count" => 1345
        ],

        [
            "img" => [""],
            "title" => "Пристрій швидкого спорядження набоїв",
            "characteristics" => ["AK", "Калібр — 5,45", "Калібр — 7,62", "Вага — 56 гр"],
            "subtitle" => "Портативний та легкий пристрій. Може використовуватись за несприятливих погодних умов (в дощ/сніг, при низькій/високій температурі) ",
            "details" => ['Всі металеві компоненти – з нержавіючої сталі', 'Механізм кріплення повністю співпадає з оригінальним на зброї ', 'Є можливість кріплення до спорядження ', 'Повністю сумісний як з армійськими так і з цивільними магазинами різних виробників'],
            "benefits" => ["Зручніше в темряві", "Зручніше на морозі", "Швидше споряджання", "Менше зусиль при заряджанні"],
            "cost" => 10,
            "count" => 1345
        ],

        [
            "img" => [""],
            "title" => "Пристрій швидкого спорядження набоїв",
            "characteristics" => ["AK", "Калібр — 5,45", "Калібр — 7,62", "Вага — 56 гр"],
            "subtitle" => "Портативний та легкий пристрій. Може використовуватись за несприятливих погодних умов (в дощ/сніг, при низькій/високій температурі) ",
            "details" => ['Всі металеві компоненти – з нержавіючої сталі', 'Механізм кріплення повністю співпадає з оригінальним на зброї ', 'Є можливість кріплення до спорядження ', 'Повністю сумісний як з армійськими так і з цивільними магазинами різних виробників'],
            "benefits" => ["Зручніше в темряві", "Зручніше на морозі", "Швидше споряджання", "Менше зусиль при заряджанні"],
            "cost" => 10,
            "count" => 1345
        ],

        [
            "img" => [""],
            "title" => "Пристрій швидкого спорядження набоїв",
            "characteristics" => ["AK", "Калібр — 5,45", "Калібр — 7,62", "Вага — 56 гр"],
            "subtitle" => "Портативний та легкий пристрій. Може використовуватись за несприятливих погодних умов (в дощ/сніг, при низькій/високій температурі) ",
            "details" => ['Всі металеві компоненти – з нержавіючої сталі', 'Механізм кріплення повністю співпадає з оригінальним на зброї ', 'Є можливість кріплення до спорядження ', 'Повністю сумісний як з армійськими так і з цивільними магазинами різних виробників'],
            "benefits" => ["Зручніше в темряві", "Зручніше на морозі", "Швидше споряджання", "Менше зусиль при заряджанні"],
            "cost" => 10,
            "count" => 1345
        ],


    ]
@endphp

<div class="productsContainer">
    <div class="filtersContainer">
        @include('components.filters')
    </div>
    <hr />
    <ul>
        @foreach ($products as $product)
            <li>
                <div class="productContent">
                    <div class="productData">
                        <h1>{{ $product['title'] }}</h1>

                        <div class="productCharacter">
                            @foreach ($product['characteristics'] as $character)
                                <span>{{ $character }}</span>
                            @endforeach
                        </div>
                        <p class="productSubtitle">{{ $product['subtitle'] }}</p>
                        <input type="checkbox" id="toggleDetails{{ $loop->index }}" class="toggleCheckbox" hidden>
                        <label for="toggleDetails{{ $loop->index }}" class="toggleLabel">Більше</label>
                        <div class="productDetails">
                            <ol class="toggleContent">
                                @foreach ($product['details'] as $details)
                                    <li>{{ $details }}</li>
                                @endforeach
                            </ol>
                        </div>
                    </div>

                    <div class="productCostCount">
                        <div class="costCountUp">

                            <div class="cost">
                                <p>
                                    {{ $product['count'] }} <span>од.</span>
                                </p>
                                <span>передано</span>
                            </div>
                            <div class="count">
                                <p>
                                    {{ $product['cost'] }},00 <span>грн</span>
                                </p>
                                <span>собівартість за од.</span>
                            </div>
                        </div>
                        <button>Замовити <i class="ph ph-plus"></i></button>
                    </div>
                </div>
            </li>
        @endforeach
    </ul>

</div>